system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
// wall
    (0.15 0.3 0) //0
    (-0.15 0.3 0) //1
    (-0.15 -0.3 0) //2
    (0.15 -0.3 0) //3

    (0.15 0.3 0.45) //4
    (-0.15 0.3 0.45) //5
    (-0.15 -0.3 0.45) //6
    (0.15 -0.3 0.45) //7

    (0 0 0) //8
    (0 0 0.45) //9
// ring
    (0.075 0.3 0) //10
    (-0.075 0.3 0) //11
    (-0.075 -0.3 0) //12
    (0.075 -0.3 0) //13

    (0.075 0.3 0.45) //14
    (-0.075 0.3 0.45) //15
    (-0.075 -0.3 0.45) //16
    (0.075 -0.3 0.45) //17
// pipe
    (0.01 0.3 0) //18
    (-0.01 0.3 0) //19
    (-0.01 -0.3 0) //20
    (0.01 -0.3 0) //21

    (0.01 0.3 0.45) //22
    (-0.01 0.3 0.45) //23
    (-0.01 -0.3 0.45) //24
    (0.01 -0.3 0.45) //25
);

blocks
(
// wall
    hex (0 10 13 3 4 14 17 7) wall0 (30 30 150) simpleGrading (0.5 1 2)
    hex (11 1 2 12 15 5 6 16) wall1 (30 30 150) simpleGrading (2 1 2)
// ring
    hex (10 18 21 13 14 22 25 17) ring0 (45 30 150) simpleGrading (1 1 2)
    hex (19 11 12 20 23 15 16 24) ring1 (45 30 150) simpleGrading (1 1 2)
// pipe
    hex (18 19 20 21 22 23 24 25) pipe0 (14 30 150) simpleGrading (1 1 2)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (1 2 6 5)

            (10 13 21 18)
            (11 12 20 19)
// top and bottom plates
	    (0 10 14 4)
	    (10 18 22 14)
	    (18 19 23 22)
	    (11 19 23 15)
	    (1 11 15 5)

	    (3 13 17 7)
	    (13 21 25 17)
	    (21 20 24 25)
	    (12 20 24 16)
	    (2 12 16 6)
        );
    }

    ring
    {
        type patch;
        faces
        (
            (0 10 13 3)
            (1 11 12 2)
        );
    }

    pipe
    {
        type patch;
        faces
        (
            (18 21 20 19)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (14 17 25 22)
            (15 16 24 23)

            (4 14 17 7)
            (5 15 16 6)

            (22 25 24 23)

        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
