0/T.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    ring
    {
        type            fixedValue;
        value           uniform 300;
    }
    pipe
    {
        type            fixedValue;
        value           uniform 300;
    }
    atmosphere
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 300;
        value           uniform 300;
    }
    emptyRing
    {
        type            zeroGradient;
    }
    emptyPipe
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
